app/Controllers/Clientes.php

SELECT *
FROM `registros`
WHERE `reg_estado` = 1
SELECT *
FROM `clientes`
WHERE `cli_estado` = 1
AND `clientes`.`cli_id` = '4'
UPDATE `clientes` SET `cli_estado` = 0
WHERE `clientes`.`cli_id` IN ('4')
---
    public function delete($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1)->findAll();

        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers) && !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '
                .base64_encode($value['reg_clientes_id'].':'.$value['reg_llave_secreta'])){
                    $model = new ClientesModel();
                    $clientes = $model->where('cli_estado',1)->find($id);
                    if(!empty($clientes)){
                        $datos = array("cli_estado"=>0);
                        $clientes = $model->update($id, $datos);