app/Controllers/Proveedores.php

    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1) -> findAll();

        foreach($registro as $key => $value){
            if(array_key_exists('Authorization',$headers)&& !empty($headers['Authorization'])){
                if($request -> getHeader('Authorization') == 'Authorization: Basic '
                .base64_encode($value['reg_clientes_id'].':'.$value['reg_llave_secreta'])){
                    $model = new ProveedoresModel();
                    $proveedores = $model -> where('prov_estado',1)->findAll();
---
SELECT *
FROM `registros`
WHERE `reg_estado` = 1
SELECT *
FROM `proveedores`
WHERE `prov_estado` = 1

    public function show($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request -> getHeaders();
        $model = new RegistrosModel();
        $registro = $model -> where('reg_estado', 1) -> findAll();

        foreach($registro as $key => $value){
            if(array_key_exists('Authorization', $headers) && !empty($headers['Authorization'])){

                if($request -> getHeader('Authorization') == 'Authorization: Basic '
                .base64_encode($value['reg_clientes_id'].':'.$value['reg_llave_secreta'])){
                    $model = new ProveedoresModel();
                    $proveedores = $model -> where('prov_estado',1)->find($id);
---
SELECT *
FROM `registros`
WHERE `reg_estado` = 1
SELECT *
FROM `proveedores`
WHERE `prov_estado` = 1
AND `proveedores`.`prov_id` = '7'