app/Controllers/TipoComida.php

SELECT *
FROM `registros`
WHERE `reg_estado` = 1
SELECT *
FROM `tipo_comida`
WHERE `tico_estado` = 1
---
    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('reg_estado', 1) -> findAll();

        foreach($registro as $key => $value){
            if(array_key_exists('Authorization',$headers)&& !empty($headers['Authorization'])){
                if($request -> getHeader('Authorization') == 'Authorization: Basic '
                .base64_encode($value['reg_clientes_id'].':'.$value['reg_llave_secreta'])){
                    $model = new TipoComidaModel();
                    $tipocomida = $model -> where('tico_estado',1)->findAll();